[net]
height=120
width=160
channels=3
downscale=4

[convolutional]
filters=4
size=(3,1)
stride=1
pad=(2,0)
dilation=(2,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=4
size=(1,3)
stride=1
pad=(0,2)
dilation=(1,2)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=8
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=8
size=(3,1)
stride=2
pad=(1,0)
dilation=(1,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=8
size=(1,3)
stride=2
pad=(0,1)
dilation=(1,1)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=16
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=8
size=(3,1)
stride=1
pad=(2,0)
dilation=(2,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=8
size=(1,3)
stride=1
pad=(0,2)
dilation=(1,2)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=16
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=16
size=(3,1)
stride=2
pad=(1,0)
dilation=(1,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=16
size=(1,3)
stride=2
pad=(0,1)
dilation=(1,1)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=32
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=16
size=(3,1)
stride=1
pad=(2,0)
dilation=(2,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=16
size=(1,3)
stride=1
pad=(0,2)
dilation=(1,2)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=32
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=32
size=(3,1)
stride=2
pad=(1,0)
dilation=(1,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=32
size=(1,3)
stride=2
pad=(0,1)
dilation=(1,1)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=64
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=32
size=(3,1)
stride=1
pad=(2,0)
dilation=(2,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=32
size=(1,3)
stride=1
pad=(0,2)
dilation=(1,2)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=64
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=64
size=(3,1)
stride=1
pad=(2,0)
dilation=(2,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=64
size=(1,3)
stride=1
pad=(0,2)
dilation=(1,2)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=128
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=64
size=(3,1)
stride=1
pad=(2,0)
dilation=(2,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=64
size=(1,3)
stride=1
pad=(0,2)
dilation=(1,2)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=128
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=64
size=(3,1)
stride=1
pad=(2,0)
dilation=(2,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=64
size=(1,3)
stride=1
pad=(0,2)
dilation=(1,2)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=128
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=64
size=(3,1)
stride=1
pad=(2,0)
dilation=(2,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=64
size=(1,3)
stride=1
pad=(0,2)
dilation=(1,2)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=128
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[convolutional]
filters=32
size=(3,1)
stride=1
pad=(2,0)
dilation=(2,1)
activation=linear
hasBias=0

[convolutional]
input=-2
filters=32
size=(1,3)
stride=1
pad=(0,2)
dilation=(1,2)
activation=linear
hasBias=0

[concat]
from=-2
activation=linear

[batchnorm]
activation = relu

[convolutional]
filters=64
size=1
stride=1
pad=0
dilation=1
activation=linear
hasBias=0

[batchnorm]
activation = relu

[transposedconv]
filters=32
size=3
stride=2
pad=1
outpad=1
activation=linear

[batchnorm]
activation = relu

[shortcut]
activation=linear
from=29

[transposedconv]
filters=16
size=3
stride=2
pad=1
outpad=1
activation=linear

[batchnorm]
activation = relu

[shortcut]
activation=linear
from=17

[transposedconv]
filters=8
size=3
stride=2
pad=1
outpad=1
activation=linear

[batchnorm]
activation = relu

[shortcut]
activation=linear
from=5

[convolutional]
filters=5
size=1
stride=1
pad=0
activation=linear

[softmax]




